{
  "name": "Alyxian the Hunter",
  "source": "CRCotN",
  "page": 160,
  "size": [
    "M"
  ],
  "type": "construct",
  "tags": [],
  "alignment": [
    "U"
  ],
  "ac": [
    "17"
  ],
  "hp": 178,
  "speed": {
    "walk": 30,
    "swim": 30
  },
  "str": 22,
  "dex": 9,
  "con": 20,
  "int": 3,
  "wis": 11,
  "cha": 1,
  "skills": {},
  "passive": 10,
  "languages": [
    "understands the languages of its creator but can't speak"
  ],
  "cr": "10",
  "prof_bonus": 4,
  "traits": [
    {
      "name": "Immutable Form",
      "entries": [
        "The golem is immune to any spell or effect that would alter its form."
      ]
    },
    {
      "name": "Magic Resistance",
      "entries": [
        "The golem has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Magic Weapons",
      "entries": [
        "The golem's weapon attacks are magical."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The golem makes two slam attacks."
      ]
    },
    {
      "name": "Ruidium Dart",
      "entries": [
        "The golem can conjure a magic dart made of ruidium and hurl it at another creature it can see within 120 feet of itself. The dart strikes the target unerringly and vanishes on contact. The target must make a DC 17 Charisma saving throw. On a failed saving throw, the target takes 24 (7d6 damage) psychic damage and gains 1 level of {@condition exhaustion}. In addition, if the target is not already suffering from ruidium corruption, it becomes corrupted when it fails the saving throw. On a successful saving throw, the target takes half as much damage and suffers no other effects."
      ]
    },
    {
      "name": "Slam",
      "entries": [
        "Melee atk +10 to hit, reach 5 ft., one target. 19 (3d8 + 6 damage) bludgeoning damage."
      ]
    },
    {
      "name": "Slow {@recharge 5}",
      "entries": [
        "The golem targets one or more creatures it can see within 10 feet of it. Each target must make a DC 17 Wisdom saving throw against this magic. On a failed save, a target can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the target can take either an action or a bonus action on its turn, not both. These effects last for 1 minute. A target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "charmed",
    "exhaustion",
    "frightened",
    "paralyzed",
    "petrified",
    "poisoned"
  ],
  "resist": [],
  "vulnerable": [],
  "immune": [
    "poison",
    "psychic",
    "bludgeoning (from nonmagical attacks that aren't adamantine)",
    "piercing (from nonmagical attacks that aren't adamantine)",
    "slashing (from nonmagical attacks that aren't adamantine)"
  ],
  "senses": [
    "darkvision 120 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}