{
  "name": "Ancient Corpse Walker",
  "source": "GHLoE",
  "page": 104,
  "size": [
    "L"
  ],
  "type": "undead",
  "tags": [
    "shapechanger"
  ],
  "alignment": [
    "C",
    "E"
  ],
  "ac": [
    "16"
  ],
  "hp": 123,
  "speed": {
    "walk": 40
  },
  "str": 19,
  "dex": 15,
  "con": 19,
  "int": 10,
  "wis": 12,
  "cha": 9,
  "skills": {
    "perception": "+5"
  },
  "passive": 15,
  "languages": [
    "languages it knew in life"
  ],
  "cr": "10",
  "prof_bonus": 4,
  "traits": [
    {
      "name": "Cursed Gaze",
      "entries": [
        "A humanoid that starts its turn within 30 feet of and able to see the ancient corpse walker must succeed on a {@dc 16} Charisma saving throw, provided the corpse walker isn't {@condition incapacitated}. On a failure, the humanoid is {@condition frightened} for 1 minute. A {@condition frightened} target can repeat the saving throw at the end of each of its turns, with disadvantage if not averting its eyes from the corpse walker, ending the effect on itself on a success. A creature failing two of these saving throws becomes cursed with disturbing thoughts. Such a creature can't benefit from a short or long rest until the curse is removed. On a successful save, the target is immune to any corpse walker's Cursed Gaze for the next 24 hours.",
        "Unless surprised, a creature can avert its eyes to avoid the saving throw. If the creature does so, it can't see the corpse walker until the start of its next turn. A creature that looks at the corpse walker in the meantime must immediately make the save."
      ]
    },
    {
      "name": "Spore Calling",
      "entries": [
        "When the ancient corpse walker attacks, loyal undead within 120 feet of it come to its aid. Moderate or stronger wind can disperse these spores before they are effective."
      ]
    },
    {
      "name": "Spore Cloud",
      "entries": [
        "If the ancient corpse walker isn't in sunlight, it can use its action to polymorph into a Large cloud of spores or back into its true form. Anything it's wearing or carrying transforms with it. It reverts to its true form if it dies. In cloud form, the ancient corpse walker can't take any actions, speak, or manipulate objects. It's weightless, has a flying speed of 20 feet, can hover, and can enter a hostile creature's space and stop there. This cloud spreads around corners. If air can pass through a space, the cloud can do so without squeezing, but it can't pass through water. It has advantage on Strength, Dexterity, and Constitution saving throws, except those against wind. The cloud form is immune to nonmagical damage other than that from sunlight.",
        "A creature that starts its turn in the cloud must make a {@dc 16} Constitution saving throw. If the save fails,Â the creature takes 13 {@dice 3d8} poison and 10 ({@damage 3d6}) necrotic damage and becomes {@condition poisoned} until the start of its next turn. On a successful save, a creature takes half the damage and isn't {@condition poisoned}.",
        "After 24 hours, corpses of beasts or humanoids that were in the spore area rise as zombies loyal to the ancient corpse walker. If such a corpse is that of an evil humanoid, it instead rises as a corpse walker loyal to the ancient corpse walker. These spores can animate a corpse only once."
      ]
    },
    {
      "name": "Spore Fortitude",
      "entries": [
        "If damage reduces the ancient corpse walker to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the corpse walker drops to 1 hit point instead.",
        "When it drops to 0 hit points, the ancient corpse walker transforms into its Spore Cloud form. If it can't transform, it is destroyed. The spores of this cloud deal half their normal damage and can't animate corpses.",
        "The ancient corpse walker can't transform back into its true form until it has at least 1 hit point. It must reach its preferred resting place within 2 hours or be destroyed. Once in its resting place, it reverts to its normal form.",
        "It is then {@condition paralyzed} and at 0 hit points for 1 hour, and then it regains 1 hit point and ceases being {@condition paralyzed}.",
        "If the ancient corpse walker takes damage while at 0 hit points, if able, it makes the same saving throw that would allow it to drop to 1 hit point. However, on a success, the ancient corpse walker remains at 0 hit points. If the ancient corpse walker fails or can't make this saving throw, it is destroyed."
      ]
    },
    {
      "name": "Sunlight Hypersensitivity",
      "entries": [
        "The ancient corpse walker takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The ancient corpse walker makes two slam attacks."
      ]
    },
    {
      "name": "Slam",
      "entries": [
        "Melee atk +8 to hit, reach 5 ft., one target. 11 (2d6 + 4 damage) bludgeoning damage and 10 (3d6 damage) necrotic damage. If the target is a creature, it must succeed on a DC 15 Constitution saving throw, or its hit point maximum is reduced by an amount equal to the necrotic damage taken, and the ancient corpse walker regains hit points equal to that amount. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. A humanoid slain this way rises 24 hours later as a zombie, but it rises as a corpse walker if it was evil. These undead are loyal to the ancient corpse walker."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "exhaustion",
    "poisoned"
  ],
  "resist": [
    "bludgeoning",
    "piercing",
    "slashing"
  ],
  "vulnerable": [],
  "immune": [
    "necrotic",
    "poison"
  ],
  "senses": [
    "darkvision 120 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": false
}