{
  "name": "Bloodbonded",
  "source": "GHLoE",
  "page": 39,
  "size": [
    "M"
  ],
  "type": "monstrosity",
  "tags": [],
  "alignment": [
    "C",
    "E"
  ],
  "ac": [
    "16"
  ],
  "hp": 66,
  "speed": {
    "walk": {
      "number": 30,
      "condition": "(or 10 ft. if missing a leg)"
    }
  },
  "str": 12,
  "dex": 15,
  "con": 13,
  "int": 15,
  "wis": 7,
  "cha": 18,
  "skills": {
    "deception": "+6",
    "insight": "+0",
    "persuasion": "+6"
  },
  "passive": 8,
  "languages": [
    "Celestial",
    "Infernal",
    "one national language"
  ],
  "cr": "4",
  "prof_bonus": 2,
  "traits": [
    {
      "name": "Bloody Inspiration",
      "entries": [
        "As a bonus action, the bloodbonded can inspire an ally within 30 feet to an enraged state of bloodlust for one minute. These followers gain 5 temporary hp, resistance to bludgeoning, piercing, and slashing damage, and vulnerability to psychic damage. All attacks made by the bloodbonded followers are reckless, gaining advantage to hit enemies but granting enemies advantage on attacks against them."
      ]
    },
    {
      "name": "Resolute Followers",
      "entries": [
        "Allies of the bloodbonded within 60 feet of it have advantage on Charisma and Wisdom saving throws."
      ]
    }
  ],
  "actions": [
    {
      "name": "Mace",
      "entries": [
        "Melee atk +3 to hit, reach 5 ft., one target. 4 (1d6 + 1 damage) bludgeoning damage."
      ]
    },
    {
      "name": "Rage Bomb (2/Day)",
      "entries": [
        "As a bonus action, the bloodbonded can infuse one of its bloodbonded followers who is under the effects of Bloody Inspiration with a fatal fury. This magic causes the follower to foam bloodily at the mouth. If the follower is not slain before the start of the bloodbonded's next turn, the follower dies and explodes in a shower of superheated blood. Creatures within 10 feet must make a DC 14 Dexterity saving throw, taking 12 (2d8 + 3 damage) fire damage on a failure and taking half damage on a success."
      ]
    },
    {
      "name": "Blood Boil",
      "entries": [
        "The bloodbonded targets a creature it can see within 60 feet and utters words of madness. The target must succeed on a DC 14 Constitution saving throw or take 9 (2d8 damage) fire damage as its blood superheats. The bloodbonded must be able to speak to use this ability."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "charmed",
    "frightened"
  ],
  "resist": [
    "necrotic",
    "radiant"
  ],
  "vulnerable": [
    "psychic"
  ],
  "immune": [],
  "senses": [],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}