{
  "name": "Bodhi Irenicus",
  "source": "MaBJoV",
  "page": 76,
  "size": [
    "M"
  ],
  "type": "undead",
  "tags": [
    "shapechanger"
  ],
  "alignment": [
    "C",
    "E"
  ],
  "ac": [
    "17"
  ],
  "hp": 144,
  "speed": {
    "walk": 30
  },
  "str": 18,
  "dex": 20,
  "con": 18,
  "int": 16,
  "wis": 15,
  "cha": 18,
  "skills": {
    "perception": "+7",
    "stealth": "+15"
  },
  "passive": 17,
  "languages": [
    "Common",
    "Elvish",
    "Sylvan"
  ],
  "cr": "15",
  "prof_bonus": 5,
  "traits": [
    {
      "name": "Legendary Resistance (3/Day)",
      "entries": [
        "If Bodhi Irenicus fails a saving throw, she can choose to succeed instead."
      ]
    },
    {
      "name": "Regeneration",
      "entries": [
        "Bodhi Irenicus regains 20 hit points at the start of her turn if she has at least 1 hit point and isn't in sunlight. If she takes radiant damage, this trait doesn't function at the start of her next turn."
      ]
    },
    {
      "name": "Shapechanger",
      "entries": [
        "If Bodhi Irenicus isn't in sun light, she can use her action to polymorph into a Medium panther or back into her true form. While in panther form, Bodhi Irenicus can't speak, her walking speed is 40 feet, and she has a climb speed of 30 feet. Her statistics, other than her size and speed, are unchanged. Anything she is wearing transforms with her, but nothing she is carrying does. She reverts to her true form if she dies."
      ]
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "entries": [
        "Bodhi deals an extra 28 ({@damage 8d6}) damage when she hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 ft. of an ally of Bodhi that isn't incapacitated and Bodhi doesn't have disadvantage on the attack roll."
      ]
    },
    {
      "name": "Spider Climb",
      "entries": [
        "Bodhi Irenicus can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    },
    {
      "name": "Summoned By Name (1/Day)",
      "entries": [
        "If a creature says Bodhi",
        "Irenicus's full name 9 times in a row, Bodhi hears her name and becomes aware of the creature. Bodhi knows the exact location and name of the creature that spoke her name. She can then choose, as a free action, to teleport to a location adjacent to the creature. She must choose to do this within 1 minute of hearing her name. This power works even if the creature is on a different plane of existence. 1 minute after teleporting, Bodhi will teleport back to where she was located when she heard her name spoken. This occurs even if Bodhi is unwilling and even if she is in an antimagic effect."
      ]
    },
    {
      "name": "Vampire Weaknesses",
      "entries": [
        "Bodhi Irenicus has the following flaws: Elvish Song. Bodhi Irenicus can't abide a song performed in the elvish language. A creature that can speak the elvish language can use an action to sing an elven song. If Bodhi is within 60 feet of the singer and can hear the song, she has disadvantage on attacks and saving throws."
      ]
    },
    {
      "name": "Stake to the Heart",
      "entries": [
        "If a piercing weapon made of wood is driven into Bodhi's heart while she is {@condition incapacitated} in her resting place, Bodhi Irenicus the vampire is {@condition paralyzed} until the stake is removed."
      ]
    },
    {
      "name": "Sunlight Hypersensitivity",
      "entries": [
        "Bodhi Irenicus takes 20 radiant damage when she starts her turn in sunlight. While in sunlight, she has disadvantage on attack rolls and ability checks."
      ]
    },
    {
      "name": "Rejuvenation",
      "entries": [
        "If Bodhi is destroyed, her body immediately appears in her resting place. She is {@condition paralyzed} until she regains at least 1 hit point. After spending 24 hours in her resting place with 0 Hit Points, she regains 1 hit point. While {@condition paralyzed} in this manner, if a creature within 60 ft. says her name 9 times, Bodhi is permanently destroyed."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack (Vampire Form Only)",
      "entries": [
        "Bodhi Irenicus makes two attacks, only one of which can be a bite attack."
      ]
    },
    {
      "name": "Unarmed Strike (Vampire Form Only)",
      "entries": [
        "Melee atk +10 to hit, reach 5 ft., one creature. 9 (1d8 + 5 damage) bludgeoning damage. Instead of dealing damage, Bodhi Irenicus can grapple the target (escape DC 18)."
      ]
    },
    {
      "name": "Bite (Panther or Vampire Form Only)",
      "entries": [
        "Melee atk +10 to hit, reach 5 ft., one creature. 8 (1d6 + 5 damage) piercing damage plus 10 (3d6 damage) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Bodhi Irenicus regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. A humanoid slain in this way and then buried in the ground rises the following night as a vampire spawn under Bodhi's control."
      ]
    },
    {
      "name": "Charm",
      "entries": [
        "Bodhi Irenicus targets one humanoid she can see within 30 ft. of her. If the target can see Bodhi, the target must succeed on a DC 17 Wisdom saving throw against this magic or be {@condition charmed} by Bodhi. The {@condition charmed} target regards the Bodhi as a trusted friend to be heeded and protected. Although the target isn't under Bodhi's control, it takes Bodhi's requests or actions in the most favorable way it can. Each time Bodhi Irenicus or her companions do anything harmful to the target, it can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until Bodhi Irenicus is destroyed, is on a different plane of existence than the target, or takes a bonus action to end the effect."
      ]
    }
  ],
  "legendary": [
    {
      "name": "Move",
      "entries": [
        "Bodhi Irenicus moves up to her speed without provoking opportunity attacks."
      ]
    },
    {
      "name": "Unarmed Strike",
      "entries": [
        "Bodhi Irenicus makes one unarmed strike."
      ]
    },
    {
      "name": "Bite (Costs 2 Actions)",
      "entries": [
        "Bodhi Irenicus makes one bite attack."
      ]
    }
  ],
  "spellcasting": [],
  "conditionImmune": [],
  "resist": [
    "necrotic",
    "bludgeoning",
    "piercing",
    "slashing"
  ],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "darkvision 120 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}