{
  "name": "Chapped Brute Abomination",
  "source": "GHLoE",
  "page": 68,
  "size": [
    "H"
  ],
  "type": "monstrosity",
  "tags": [],
  "alignment": [
    "C",
    "E"
  ],
  "ac": [
    "16"
  ],
  "hp": 161,
  "speed": {
    "walk": 40
  },
  "str": 23,
  "dex": 10,
  "con": 20,
  "int": 3,
  "wis": 10,
  "cha": 5,
  "skills": {
    "athletics": "+10"
  },
  "passive": 10,
  "languages": [],
  "cr": "9",
  "prof_bonus": 4,
  "traits": [
    {
      "name": "Adaptive Hide",
      "entries": [
        "After taking damage, the chapped brute abomination gains resistance to that type of damage until it takes another type of damage."
      ]
    },
    {
      "name": "Keen Hearing and Smell",
      "entries": [
        "The chapped brute abomination has advantage on Wisdom (Perception) checks that rely on hearing or smell. While {@condition deafened} and unable to smell, the brute can't use its blindsight."
      ]
    },
    {
      "name": "Unstable Life",
      "entries": [
        "At the start of the chapped brute abomination's turn, roll {@dice 1d20}. The abomination regains hit points equal to any even result and loses hit points equal to any odd result. The abomination can neither exceed its hit point maximum with a gain nor fall below 1 hit point with a loss."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The chapped brute abomination makes two tentacle attacks."
      ]
    },
    {
      "name": "Tentacle",
      "entries": [
        "Melee atk +10 to hit, reach 20 ft., one target. 22 (3d10 + 6 damage) bludgeoning damage. If the target is Medium or smaller, it is {@condition grappled} (escape DC 18). Until this grapple ends, the target is {@condition restrained}, and the brute can't use the tentacle against another target. The chapped brute abomination has four tentacles."
      ]
    },
    {
      "name": "Engulf",
      "entries": [
        "Each creature {@condition grappled} by the chapped brute abomination must succeed on a DC 18 Strength saving throw or be pulled into the brute's body. An engulfed target is {@condition blinded}, {@condition restrained}, unable to breathe, and has total cover from effects that originate outside the brute. At the start of each of the brute's turns, each engulfed creature takes 14 (4d6 damage) acid damage. The brute can hold only one Large creature or up to four Medium or smaller creatures inside it at a time.",
        "An engulfed creature can try to escape by taking an action to make its choice of a {@dc 18} Strength (Athletics) or Dexterity (Acrobatics) check. On a success, the creature escapes and uses 10 feet of movement to enter a space of its choice within 5 feet of the brute.",
        "If the brute dies, an engulfed creature is no longer {@condition restrained} by it and can escape from the corpse by using 10 feet of movement.",
        "If a creature dies inside the brute, the brute doesn't roll for Unstable Life at the start of its next turn and instead regains 20 hit points. The creature's body breaks up inside the brute, and the brute expels anything the creature wore or carried."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "blinded",
    "prone"
  ],
  "resist": [
    "necrotic"
  ],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "blindsight 90 ft. (blind beyond this radius)"
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": false
}