{
  "name": "Construct (Shield Guardian)",
  "source": "PSK",
  "page": 32,
  "size": [
    "L"
  ],
  "type": "construct",
  "tags": [],
  "alignment": [
    "U"
  ],
  "ac": [
    "17"
  ],
  "hp": 142,
  "speed": {
    "walk": 30
  },
  "str": 18,
  "dex": 8,
  "con": 18,
  "int": 7,
  "wis": 10,
  "cha": 3,
  "skills": {},
  "passive": 10,
  "languages": [
    "understands commands given in any language but can't speak"
  ],
  "cr": "7",
  "prof_bonus": 3,
  "traits": [
    {
      "name": "Bound",
      "entries": [
        "The construct is magically bound to an amulet. As long as the construct and its amulet are on the same plane of existence, the amulet's wearer can telepathically call the construct to travel to it, and the construct knows the distance and direction to the amulet. If the construct is within 60 feet of the amulet's wearer, half of any damage the wearer takes (rounded up) is transferred to the construct."
      ]
    },
    {
      "name": "Regeneration",
      "entries": [
        "The construct regains 10 hit points at the start of its turn if it has at least 1 hit point."
      ]
    },
    {
      "name": "Spell Storing",
      "entries": [
        "A spellcaster who wears the construct's amulet can cause the construct to store one spell of 4th level or lower. To do so, the wearer must cast the spell on the construct. The spell has no effect but is stored within the construct. When commanded to do so by the wearer or when a situation arises that was predefined by the spellcaster, the construct casts the stored spell with any parameters set by the original caster, requiring no components. When the spell is cast or a new spell is stored, any previously stored spell is lost."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The construct makes two fist attacks."
      ]
    },
    {
      "name": "Fist",
      "entries": [
        "Melee atk +7 to hit, reach 5 ft., one target. 11 (2d6 + 4 damage) bludgeoning damage."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "charmed",
    "exhaustion",
    "frightened",
    "paralyzed",
    "poisoned"
  ],
  "resist": [],
  "vulnerable": [],
  "immune": [
    "poison"
  ],
  "senses": [
    "blindsight 10 ft.",
    "darkvision 60 ft."
  ],
  "environment": [
    "urban"
  ],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}