{
  "name": "Elf Vampire (Ancient)",
  "source": "GHLoE",
  "page": 106,
  "size": [
    "M"
  ],
  "type": "undead",
  "tags": [],
  "alignment": [
    "L",
    "NX",
    "C",
    "E"
  ],
  "ac": [
    "18"
  ],
  "hp": 209,
  "speed": {
    "walk": 40,
    "climb": 40
  },
  "str": 20,
  "dex": 20,
  "con": 20,
  "int": 15,
  "wis": 16,
  "cha": 16,
  "skills": {
    "arcana": "+8",
    "athletics": "+11",
    "history": "+8",
    "perception": "+9",
    "stealth": "+11"
  },
  "passive": 19,
  "languages": [
    "the languages known in life"
  ],
  "cr": "19",
  "prof_bonus": 6,
  "traits": [
    {
      "name": "Legendary Resistance (3/Day)",
      "entries": [
        "If the vampire fails a saving throw, it can choose to succeed instead."
      ]
    },
    {
      "name": "Regeneration",
      "entries": [
        "The vampire regains 25 hit points at the start of its turn if it has at least 1 hit point. If the vampire takes radiant damage, it regains 10 hit points from the next use of this trait instead."
      ]
    },
    {
      "name": "Spider Climb",
      "entries": [
        "The vampire can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    },
    {
      "name": "Turn Resistance",
      "entries": [
        "The vampire has advantage on saving throws against any effect that turns undead."
      ]
    },
    {
      "name": "Vampire Weaknesses",
      "entries": [
        "The vampire has the following flaws:"
      ]
    },
    {
      "name": "Forbiddance",
      "entries": [
        "The vampire can't enter a residence without an invitation from one of the occupants."
      ]
    },
    {
      "name": "Stake to the Heart",
      "entries": [
        "The vampire dies if a piercing weapon made of wood is driven into its heart while it is {@condition incapacitated} in its resting place."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The vampire makes three attacks, only one of which can be a bite."
      ]
    },
    {
      "name": "Claws",
      "entries": [
        "Melee atk +11 to hit, reach 5 ft., one target. 15 (2d8 + 6 damage) slashing damage. If the target is a creature, the vampire can grapple the target (escape DC 19)."
      ]
    },
    {
      "name": "Bite",
      "entries": [
        "Melee atk +11 to hit, reach 5 ft., one creature. 15 (2d8 + 6 damage) piercing damage and 17 (5d6 damage) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. A humanoid slain in this way and then buried rises the following night as a vampire spawn under this vampire's control."
      ]
    },
    {
      "name": "Fey Majesty",
      "entries": [
        "The vampire targets one creature it can see within 30 feet of it. If the target can see or hear the vampire, the target must succeed on a DC 17 Charisma saving throw or be {@condition charmed}. The {@condition charmed} target regards the vampire as a friend to be heeded and protected. Although not under the vampire's control, it takes the vampire's requests in the most favorable way and is a willing target for the vampire's bite.",
        "While the target is {@condition charmed}, the vampire can communicate with the target telepathically within 300 feet. The vampire can use a bonus action to force the target to repeat the saving throw. If the save fails, the vampire can render the creature full of despair (disadvantage on ability checks and attack rolls) or confused (as the {@spell confusion} spell) for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the despair or confusion on itself on a success.",
        "Each time the vampire or the vampire's allies do anything harmful to the target, it can repeat the saving throw, ending the effect on a success. Otherwise, the effect lasts 24 hours or until the vampire dies, is on a different plane of existence than the target, or takes a bonus action to end the effect."
      ]
    },
    {
      "name": "Mist Form",
      "entries": [
        "The vampire polymorphs into a Medium cloud of mist, or back into its true form. Anything it wears or carries transforms with it. While in mist form, the vampire can't take any actions, speak, or manipulate objects. It is weightless, has a flying speed of 30 feet, can hover, and can enter a hostile creature's space and stop there. In addition, if air can pass through a space, the mist can do so without squeezing, but it can't pass through water. It has advantage on Strength, Dexterity, and Constitution saving throws. A vampire in mist form is immune to nonmagical damage, except damage from sunlight, and has resistance to damage other than radiant. The vampire reverts to its true form if it dies."
      ]
    }
  ],
  "legendary": [
    {
      "name": "Move and Claw",
      "entries": [
        "The vampire moves up to its speed and attacks once with its claws."
      ]
    },
    {
      "name": "Bite (2 Actions)",
      "entries": [
        "The vampire makes one bite attack."
      ]
    },
    {
      "name": "Purify Blood (2 Actions)",
      "entries": [
        "Even if the vampire can't take actions, one condition ends on it."
      ]
    }
  ],
  "spellcasting": [],
  "conditionImmune": [
    "charmed",
    "unconscious"
  ],
  "resist": [
    "necrotic",
    "poison",
    "bludgeoning",
    "piercing",
    "slashing"
  ],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "blindsight 30 ft.",
    "darkvision 120 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}