{
  "name": "Fire Giant Forgecaller",
  "source": "BGG",
  "page": 138,
  "size": [
    "H"
  ],
  "type": "giant",
  "tags": [
    "cleric"
  ],
  "alignment": [
    "A"
  ],
  "ac": [
    "18"
  ],
  "hp": 312,
  "speed": {
    "walk": 30,
    "fly": {
      "number": 30,
      "condition": "(hover)"
    },
    "canHover": true
  },
  "str": 25,
  "dex": 11,
  "con": 23,
  "int": 16,
  "wis": 21,
  "cha": 18,
  "skills": {
    "athletics": "+13",
    "perception": "+11"
  },
  "passive": 21,
  "languages": [
    "Common",
    "Giant"
  ],
  "cr": "18",
  "prof_bonus": 6,
  "traits": [
    {
      "name": "Legendary Resistance (3/Day)",
      "entries": [
        "If the giant fails a saving throw, it can choose to succeed instead."
      ]
    },
    {
      "name": "Fire Rune",
      "entries": [
        "The giant has a fire rune inscribed on a medallion or some other object in its possession. While holding or wearing the object bearing the rune, the giant can use its Magma Wave action and Furnace Armor bonus action.",
        "The object bearing the rune has AC 15; 40 hit points; and immunity to necrotic, poison, and psychic damage. The object regains all its hit points at the end of every turn, but it turns to dust if reduced to 0 hit points or when the giant dies. If the rune is destroyed, the giant can inscribe a fire rune on an object in its possession when it finishes a short or long rest."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The giant makes three Forge Hammer attacks or two Heated Rock attacks."
      ]
    },
    {
      "name": "Forge Hammer",
      "entries": [
        "Melee atk +13 to hit, reach 10 ft., one target. 24 (5d6 + 7 damage) bludgeoning damage. Hit or Miss: The giant can cause the hammer to emit a burst of heat in a 30-foot-radius sphere centered on the target. Metal objects in that area glow red-hot until the start of the giant's next turn. Any creature in physical contact with a heated object at the start of its turn must make a DC 19 Constitution saving throw. On a failed save, the creature takes 10 (3d6 damage) fire damage and has disadvantage on attack rolls until the start of its next turn unless it has immunity to fire damage. The hammer can emit heat in this way only once per turn."
      ]
    },
    {
      "name": "Heated Rock",
      "entries": [
        "Ranged atk +13 to hit, range 60/240 ft., one target. 23 (3d10 + 7 damage) bludgeoning damage plus 19 (3d12 damage) fire damage. If the target is a Large or smaller creature, it must succeed on a DC 21 Strength saving throw or have the {@condition prone} condition. After the giant throws the rock, roll a {@dice d6}; on a roll of 3 or lower, the giant has no more rocks to throw."
      ]
    },
    {
      "name": "Magma Wave (Requires Fire Rune)",
      "entries": [
        "The giant emits a wave of magma from its fire rune in a 30-foot cone. Each creature in that area must make a DC 19 Dexterity saving throw. On a failed save, a creature takes 36 (8d8 damage) fire damage and has the {@condition restrained} condition. As an action, a creature can make a DC 19 Strength (Athletics) check, freeing itself or a creature within its reach from the rock on a success. The rock restraining each creature has AC 17; 20 hit points; and immunity to fire, poison, and psychic damage. On a successful save, a creature takes half as much damage only."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [],
  "resist": [],
  "vulnerable": [],
  "immune": [
    "fire"
  ],
  "senses": [],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}