{
  "name": "Frost Giant Ice Shaper",
  "source": "BGG",
  "page": 145,
  "size": [
    "H"
  ],
  "type": "giant",
  "tags": [
    "cleric"
  ],
  "alignment": [
    "A"
  ],
  "ac": [
    "16"
  ],
  "hp": 310,
  "speed": {
    "walk": 40
  },
  "str": 23,
  "dex": 10,
  "con": 21,
  "int": 11,
  "wis": 19,
  "cha": 16,
  "skills": {
    "athletics": "+12",
    "perception": "+10"
  },
  "passive": 20,
  "languages": [
    "Common",
    "Giant"
  ],
  "cr": "17",
  "prof_bonus": 6,
  "traits": [
    {
      "name": "Frost Rune",
      "entries": [
        "The giant has a frost rune inscribed on a chunk of ice or some other object in its possession. While holding or wearing the object bearing the rune, the giant can use its Ice Wolves action and Ice Armor reaction.",
        "The object bearing the rune has AC 16; 40 hit points; and immunity to necrotic, poison, and psychic damage. The object regains all its hit points at the end of every turn, but it turns to dust if reduced to 0 hit points or when the giant dies. If the rune is destroyed, the giant can inscribe a frost rune on an object in its possession when it finishes a short or long rest."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "entries": [
        "If the giant fails a saving throw, it can choose to succeed instead."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The giant makes three attacks using Greataxe, Freezing Ray, or a combination of them."
      ]
    },
    {
      "name": "Greataxe",
      "entries": [
        "Melee atk +12 to hit, reach 10 ft., one target. 22 (3d10 + 6 damage) slashing damage plus 9 (2d8 damage) cold damage."
      ]
    },
    {
      "name": "Freezing Ray",
      "entries": [
        "Ranged Spell atk +10 to hit, range 120 ft., one target. 17 (3d8 + 4 damage) cold damage, and the target must make a DC 18 Constitution saving throw. On a failed save, the target has the {@condition restrained} condition until the end of its next turn. On a successful save, the target's speed is reduced by 10 feet until the end of its next turn."
      ]
    },
    {
      "name": "Ice Wolves (Requires Frost Rune)",
      "entries": [
        "The giant magically summons {@dice 1d4} wolves made of ice (use the winter wolf stat block in the Monster Manual to represent them, but they are Elementals instead of Monstrosities). The wolves appear in unoccupied spaces the giant can see within 30 feet of itself. The wolves take their turn immediately after the giant on the same initiative count, and they obey the giant's commands. The wolves gain a +6 bonus to their attack and damage rolls while they are within 30 feet of the giant. The wolves disappear after 1 minute, when the giant dies, or when the giant uses this action again."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [],
  "resist": [],
  "vulnerable": [],
  "immune": [
    "cold"
  ],
  "senses": [],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}