{
  "name": "Infernal Tormentor",
  "source": "GHLoE",
  "page": 50,
  "size": [
    "M"
  ],
  "type": "humanoid",
  "tags": [
    "any race",
    "fiend"
  ],
  "alignment": [
    "L",
    "NX",
    "C",
    "E"
  ],
  "ac": [
    "16"
  ],
  "hp": 97,
  "speed": {
    "walk": 30
  },
  "str": 18,
  "dex": 12,
  "con": 16,
  "int": 12,
  "wis": 13,
  "cha": 15,
  "skills": {
    "intimidation": "+5",
    "perception": "+4"
  },
  "passive": 14,
  "languages": [
    "Infernal and one other language"
  ],
  "cr": "6",
  "prof_bonus": 3,
  "traits": [],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The infernal tormentor makes two greatsword attacks. It can use infernal leash in place of one attack."
      ]
    },
    {
      "name": "Greatsword",
      "entries": [
        "Melee atk +7 to hit, reach 5 ft., one target. 11 (2d6 + 4 damage) slashing damage and 7 (2d6 damage) fire damage."
      ]
    },
    {
      "name": "Infernal Leash {@recharge}",
      "entries": [
        "A flaming whip appears in the infernal tormentor's hand or from its greatsword and lashes at a creature the tormentor can see within 30 feet of it. The target must succeed on a DC 13 Charisma saving throw. A creature that has signed a fiendish contract has disadvantage on this save. On a failure, the creature takes 14 (4d6 damage) fire damage, is pulled 10 feet closer to the tormentor, and is cursed for 1 minute or until the tormentor uses this action again. This curse also ends if the target enters hallowed ground.",
        "While cursed, the target can't move more than 30 feet from the tormentor. Also while the curse lasts, the target takes 7 ({@dice 2d6}) extraÂ fire damage from the tormentor's greatsword attacks. The tormentor can use a bonus action to move the target 10 feet to an unoccupied space within 30 feet of the tormentor. If this space is dangerous, the target receives a new saving throw before moving, ending the effect on itself on a success."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [],
  "resist": [
    "fire"
  ],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "darkvision 60 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}