{
  "name": "Mjork Asher",
  "source": "GHLoE",
  "page": 71,
  "size": [
    "L"
  ],
  "type": "elemental",
  "tags": [],
  "alignment": [
    "C",
    "N"
  ],
  "ac": [
    "14"
  ],
  "hp": 85,
  "speed": {
    "walk": 30
  },
  "str": 15,
  "dex": 15,
  "con": 16,
  "int": 7,
  "wis": 13,
  "cha": 7,
  "skills": {},
  "passive": 11,
  "languages": [
    "Ignan",
    "Terran"
  ],
  "cr": "6",
  "prof_bonus": 3,
  "traits": [
    {
      "name": "Blinding Soot",
      "entries": [
        "A creature that takes fire damage from a mjork asher's attacks must make a {@dc 14} Constitution saving throw or be {@condition blinded} until the end of the mjork's next turn."
      ]
    },
    {
      "name": "Fiery Body",
      "entries": [
        "A creature that touches the mjork asher or hits it with a melee attack while within 5 feet of it takes 7 ({@damage 2d6}) fire damage."
      ]
    },
    {
      "name": "Smoke Sense",
      "entries": [
        "A mjork asher in contact with smoke has blindsight in that smoke's area in a radius of up to 120 feet."
      ]
    },
    {
      "name": "Smoke Shroud",
      "entries": [
        "While the mjork asher has 41 or more hit points, smoke renders a sphere within 20 feet of it heavily obscured. This smoke goes around corners. Even while the mjork has 40 or fewer hit points, tendrils of this smoke extend to 60 feet from the mjork, providing smoke for the Smoke Sense of all mjorks. However, the whole shroud dissipates during any round the mjork is exposed to moderate (at least 10 miles per hour) or stronger wind."
      ]
    },
    {
      "name": "Water Susceptibility",
      "entries": [
        "For every 5 feet the mjork asher moves in water, or for every gallon of water splashed on it, it takes 1 cold damage."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The mjork asher makes two attacks."
      ]
    },
    {
      "name": "Slam",
      "entries": [
        "Melee atk +5 to hit, reach 5 ft., one target. 9 (2d6 + 2 damage) bludgeoning damage and 7 (2d6 damage) fire damage and Blinding Soot."
      ]
    },
    {
      "name": "Hurl Soot",
      "entries": [
        "Ranged Spell atk +5 to hit, ranged 30/60 ft., one target. 12 (3d6 + 2 damage) fire damage and Blinding Soot."
      ]
    },
    {
      "name": "Create Sootlings (1/Day)",
      "entries": [
        "The mjork asher chooses a point within 60 feet of it that it can sense. Smoke fills a 20-foot radius sphere centered on that point. The sphere spreads around corners, and its area is heavily obscured. This smoke lasts until the start of the mjork's next turn or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. Unless dispersed before the start of the mjork's next turn, a sootling swarm forms in a space in the area, favoring a space a creature hostile to the mjork occupies. The swarm takes its turn just after the mjork and obeys the mjork's verbal commands (no action for the mjork). If issued no commands, the swarm acts independently, often attacking a creature that isn't its ally. The swarm can survive indefinitely after being created."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "exhaustion",
    "paralyzed",
    "petrified",
    "poisoned",
    "unconscious"
  ],
  "resist": [
    "bludgeoning",
    "piercing",
    "slashing"
  ],
  "vulnerable": [
    "thunder"
  ],
  "immune": [
    "fire",
    "poison"
  ],
  "senses": [
    "darkvision 60 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}