{
  "name": "Ordeal Tree",
  "source": "GHLoE",
  "page": 39,
  "size": [
    "G"
  ],
  "type": "plant",
  "tags": [],
  "alignment": [
    "N",
    "E"
  ],
  "ac": [
    "17"
  ],
  "hp": 186,
  "speed": {
    "walk": 20
  },
  "str": 24,
  "dex": 7,
  "con": 21,
  "int": 12,
  "wis": 16,
  "cha": 12,
  "skills": {},
  "passive": 13,
  "languages": [
    "Sylvan"
  ],
  "cr": "12",
  "prof_bonus": 4,
  "traits": [
    {
      "name": "Corrupt Desire",
      "entries": [
        "A humanoid may bind themselves to the ordeal tree. Each day the petitioner is bound to the tree, they must succeed on a Constitution saving throw with a DC equal to 15 + number of days bound or suffer a level of {@condition exhaustion}. If they survive for 7 days, the ordeal tree may choose to grant a blessing. The tree only does this if the humanoid is evil, once per humanoid. If the humanoid is neutral or good, the tree attacks them.",
        "The blessing is tailored to the petitioner's desires (GM discretion) but might include +1 to an ability score, a feat, expertise in a skill, or the ability to innately cast a 3rd-level (or lower) spell once per day using Charisma as the petitioner's spellcasting ability.",
        "The petitioner also contracts the curse of foul blight (Grim Hallow Campaign Guide). If the petitioner commits a profoundly evil act every day, the curse never advances beyond stage 1. If the petitioner fails to commit the act, the curse automatically escalates."
      ]
    },
    {
      "name": "False Appearance",
      "entries": [
        "While the ordeal tree remains motionless, it is indistinguishable from a normal tree."
      ]
    },
    {
      "name": "Heart Sight",
      "entries": [
        "The ordeal tree knows the alignment and desires of any creature that binds itself to the tree."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The ordeal tree makes two slam attacks and one attack with a vine or enervate."
      ]
    },
    {
      "name": "Slam",
      "entries": [
        "Melee atk +11 to hit, reach 10 ft., one target. 29 (4d10 + 7 damage) bludgeoning damage."
      ]
    },
    {
      "name": "Vine",
      "entries": [
        "Melee atk +11 to hit, reach 20 ft., one target. 20 (3d8 + 7 damage) slashing damage, and the creature is {@condition grappled} (escape DC 17)."
      ]
    },
    {
      "name": "Enervate (2/Day)",
      "entries": [
        "A creature bound to the ordeal tree or {@condition grappled} by it must succeed on a DC 17 Constitution saving throw or suffer 44 (8d10 damage) necrotic damage. The ordeal tree gains temporary hit points equal to half the damage done."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [],
  "resist": [
    "bludgeoning",
    "piercing"
  ],
  "vulnerable": [
    "fire"
  ],
  "immune": [],
  "senses": [],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}