{
  "name": "Priest of Osybus",
  "source": "VRGR",
  "page": 241,
  "size": [
    "M"
  ],
  "type": "humanoid",
  "tags": [],
  "alignment": [],
  "ac": [
    "14"
  ],
  "hp": 60,
  "speed": {
    "walk": 30
  },
  "str": 10,
  "dex": 14,
  "con": 16,
  "int": 18,
  "wis": 17,
  "cha": 11,
  "skills": {},
  "passive": 13,
  "languages": [
    "any three languages"
  ],
  "cr": "6",
  "prof_bonus": 3,
  "traits": [
    {
      "name": "Tattoo of Osybus",
      "entries": [
        "If the priest drops to 0 hit points, roll on the Boons of Undeath table for the boon the priest receives. The priest dies if it receives a boon it already has. If it receives a new boon, it revives at the start of its next turn with half its hit points restored, and its creature type is now Undead.",
        "To prevent this revival, the Tattoo of Osybus on the priest's body must be destroyed. The tattoo is invulnerable while the priest has at least 1 hit point. The tattoo is otherwise an object with AC 15, and it is immune to poison and psychic damage. It has 15 hit points, but it regains all its hit points at the end of every combatant's turn."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The priest attacks twice."
      ]
    },
    {
      "name": "Soul Blade",
      "entries": [
        "Melee atk +5 to hit, reach 5 ft., one target. 7 (2d4 + 2 damage) piercing damage, and if the target is a creature, it is {@condition paralyzed} until the start of the priest's next turn. If this damage reduces a Medium or smaller creature to 0 hit points, the creature dies, and its soul is trapped in the priest's body, manifesting as a shadowy Soul Tattoo on the priest. The soul is freed if the priest dies."
      ]
    },
    {
      "name": "Necrotic Bolt",
      "entries": [
        "Ranged Spell atk +7 to hit, range 120 ft., one target. 17 (3d8 + 4 damage) necrotic damage, and the target can't regain hit points until the start of the priest's next turn."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "frightened"
  ],
  "resist": [],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "darkvision 120 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}