{
  "name": "Strefan Maurer",
  "source": "PSI",
  "page": 33,
  "size": [
    "M"
  ],
  "type": "undead",
  "tags": [
    "shapechanger"
  ],
  "alignment": [
    "L",
    "E"
  ],
  "ac": [
    "16"
  ],
  "hp": 144,
  "speed": {
    "walk": 30
  },
  "str": 18,
  "dex": 18,
  "con": 18,
  "int": 20,
  "wis": 15,
  "cha": 18,
  "skills": {
    "arcana": "+15",
    "perception": "+12",
    "religion": "+10",
    "stealth": "+14"
  },
  "passive": 22,
  "languages": [
    "Abyssal",
    "Common",
    "Draconic",
    "Elvish",
    "Giant",
    "Infernal"
  ],
  "cr": "15",
  "prof_bonus": 5,
  "traits": [
    {
      "name": "Shapechanger",
      "entries": [
        "If Strefan isn't in running water or sunlight, he can use his action to polymorph into a Tiny bat, a Medium wolf, or a Medium cloud of mist, or back into his true form.",
        "While in bat or wolf form, Strefan can't speak. In bat form, his walking speed is 5 feet, and he has a flying speed of 30 feet. In wolf form, his walking speed is 40 feet. His statistics, other than his size and speed, are unchanged. Anything he is wearing transforms with him, but nothing he is carrying does. He reverts to his true form if he dies.",
        "While in mist form, Strefan can't take any actions, speak, or manipulate objects. He is weightless, has a flying speed of 20 feet, can hover, and can enter a hostile creature's space and stop there. In addition, if air can pass through a space, the mist can do so without squeezing, and he can't pass through water. He has advantage on Strength, Dexterity, and Constitution saving throws, and he is immune to all nonmagical damage, except the damage he takes from sunlight."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "entries": [
        "If Strefan fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Misty Escape",
      "entries": [
        "When Strefan drops to 0 hit points outside his coffin, he transforms into a cloud of mist (as in the Shapechanger trait) instead of falling {@condition unconscious}, provided that he isn't in running water or sunlight. If he can't transform, he is destroyed.",
        "While he has 0 hit points in mist form, he can't revert to his vampire form, and he must reach his coffin within 2 hours or be destroyed. Once in his coffin, he reverts to his vampire form. He is then {@condition paralyzed} until he regains at least 1 hit point. After 1 hour in his coffin with 0 hit points, he regains 1 hit point."
      ]
    },
    {
      "name": "Regeneration",
      "entries": [
        "Strefan regains 20 hit points at the start of his turn if he has at least 1 hit point and isn't in running water or sunlight. If he takes radiant damage or damage from holy water, this trait doesn't function at the start of his next turn."
      ]
    },
    {
      "name": "Spider Climb",
      "entries": [
        "Strefan can climb difficult surfaces, including upside down on ceilings, without having to make an ability check."
      ]
    },
    {
      "name": "Vampire Weaknesses",
      "entries": [
        "Strefan has the following flaws:",
        "{@i Forbiddance.} He can't enter a residence without an invitation from one of the occupants.",
        "{@i Harmed by Running Water.} He takes 20 acid damage if he ends his turn in running water.",
        "{@i Stake to the Heart.} If a piercing weapon made of wood is driven into his heart while he is {@condition incapacitated} in his coffin, he is {@condition paralyzed} until the stake is removed.",
        "{@i Sunlight Hypersensitivity.} While in sunlight, Strefan takes 20 radiant damage at the start of his turn, and he has disadvantage on attack rolls and ability checks."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack (Vampire Form Only)",
      "entries": [
        "Strefan makes two attacks, only one of which can be a bite attack."
      ]
    },
    {
      "name": "Unarmed Strike (Vampire or Wolf Form Only)",
      "entries": [
        "Melee atk +9 to hit, reach 5 ft., one target. 8 (1d8 + 4 damage) slashing damage, plus 14 (4d6 damage) necrotic damage. If the target is a creature, Strefan can grapple it (escape DC 18) instead of dealing the slashing damage."
      ]
    },
    {
      "name": "Bite",
      "entries": [
        "Melee atk +9 to hit, reach 5 ft., one willing creature, or a creature that is {@condition grappled} by Strefan, {@condition incapacitated}, or {@condition restrained}. 7 (1d6 + 4 damage) piercing damage plus 10 (3d6 damage) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Strefan regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if its hit point maximum is reduced to 0. A humanoid slain in this way and then buried in the ground rises the following night as a {@creature vampire spawn} under Strefan's control."
      ]
    },
    {
      "name": "Charm",
      "entries": [
        "Strefan targets one humanoid he can see within 30 feet of him. If the target can see Strefan, the target must succeed on a DC 17 Wisdom saving throw against this magic or be {@condition charmed}. The {@condition charmed} target regards Strefan as a trusted friend to be heeded and protected. The target isn't under Strefan's control, but it takes Strefan's requests and actions in the most favorable way and lets Strefan bite it.",
        "Each time Strefan or his companions do anything harmful to the target, it can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until Strefan is destroyed, is on a different plane of existence than the target, or takes a bonus action to end the effect."
      ]
    },
    {
      "name": "Children of the Night (1/Day)",
      "entries": [
        "Strefan magically calls {@dice 2d4} {@creature swarm of bats||swarms of bats} or {@creature swarm of rats||swarms of rats}, provided that the sun isn't up. While outdoors, Strefan can call {@dice 3d6} {@creature wolf||wolves} instead. The called creatures arrive in {@dice 1d4} rounds, acting as allies of Strefan and obeying his spoken commands. The beasts remain for 1 hour, until Strefan dies, or until he dismisses them as a bonus action."
      ]
    }
  ],
  "legendary": [
    {
      "name": "Move",
      "entries": [
        "Strefan moves up to his speed without provoking opportunity attacks."
      ]
    },
    {
      "name": "Unarmed Strike",
      "entries": [
        "Strefan makes one unarmed strike."
      ]
    },
    {
      "name": "Bite (Costs 2 Actions)",
      "entries": [
        "Strefan makes one bite attack."
      ]
    }
  ],
  "spellcasting": [
    {
      "name": "Spellcasting",
      "headerEntries": [
        "Strefan is a 9th-level spellcaster. His spellcasting ability is Intelligence (spell save {@dc 18}, {@hit 10} to hit with spell attacks). He has the following wizard spells prepared:"
      ],
      "spells": {
        "0": {
          "spells": [
            "mage hand",
            "prestidigitation",
            "ray of frost"
          ]
        },
        "1": {
          "spells": [
            "comprehend languages",
            "fog cloud",
            "sleep"
          ]
        },
        "2": {
          "spells": [
            "detect thoughts",
            "gust of wind",
            "mirror image"
          ]
        },
        "3": {
          "spells": [
            "animate dead",
            "fireball",
            "nondetection"
          ]
        },
        "4": {
          "spells": [
            "blight",
            "greater invisibility",
            "polymorph"
          ]
        },
        "5": {
          "spells": [
            "animate objects",
            "scrying"
          ]
        },
        "6": {
          "spells": []
        },
        "7": {
          "spells": []
        },
        "8": {
          "spells": []
        },
        "9": {
          "spells": []
        }
      },
      "ability": "int",
      "daily": {
        "1": []
      },
      "will": []
    }
  ],
  "conditionImmune": [],
  "resist": [
    "necrotic",
    "bludgeoning",
    "piercing",
    "slashing"
  ],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "darkvision 120 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}