{
  "name": "Vampire Neonate",
  "source": "PSI",
  "page": 17,
  "size": [
    "M"
  ],
  "type": "undead",
  "tags": [],
  "alignment": [
    "N",
    "E"
  ],
  "ac": [
    "15"
  ],
  "hp": 82,
  "speed": {
    "walk": 30
  },
  "str": 16,
  "dex": 16,
  "con": 16,
  "int": 11,
  "wis": 10,
  "cha": 12,
  "skills": {
    "perception": "+3",
    "stealth": "+6"
  },
  "passive": 13,
  "languages": [
    "Common"
  ],
  "cr": "5",
  "prof_bonus": 3,
  "traits": [
    {
      "name": "Regeneration",
      "entries": [
        "The vampire regains 10 hit points at the start of its turn if it has at least 1 hit point. If the vampire takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampire's next turn."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The vampire makes two attacks, only one of which can be a bite attack."
      ]
    },
    {
      "name": "Claws",
      "entries": [
        "Melee atk +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3 damage) slashing damage. Instead of dealing damage, the vampire can grapple the target (escape DC 13)."
      ]
    },
    {
      "name": "Bite",
      "entries": [
        "Melee atk +6 to hit, reach 5 ft., one willing creature, or a creature that is {@condition grappled} by the vampire, {@condition incapacitated}, or {@condition restrained}. 6 (1d6 + 3 damage) piercing damage plus 7 (2d6 damage) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0."
      ]
    },
    {
      "name": "Vampiric Glamer",
      "entries": [
        "The vampire obscures its form with mind-affecting magic that makes others perceive it as a beautiful human of the same size and shape. The illusion ends if the vampire takes a bonus action to end it or if the vampire dies. A creature that can see the vampire can take an action to visually inspect it, ending the mental effect on itself and seeing the vampire's true form with a successful DC 20 Wisdom (Perception) check."
      ]
    },
    {
      "name": "Aura of Silence",
      "entries": [
        "The vampire shrouds itself in a cloak of silence to a radius of 2 feet. Within that radius, the effect is the same as the {@spell silence} spell."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [],
  "resist": [
    "necrotic",
    "bludgeoning",
    "piercing",
    "slashing"
  ],
  "vulnerable": [],
  "immune": [],
  "senses": [
    "darkvision 60 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": true
}