{
  "name": "Zombie Plague Spreader",
  "source": "VRGR",
  "page": 255,
  "size": [
    "M"
  ],
  "type": "undead",
  "tags": [],
  "alignment": [],
  "ac": [
    "10"
  ],
  "hp": 78,
  "speed": {
    "walk": 30
  },
  "str": 16,
  "dex": 10,
  "con": 15,
  "int": 3,
  "wis": 5,
  "cha": 5,
  "skills": {},
  "passive": 7,
  "languages": [
    "understands the languages it knew in life but can't speak"
  ],
  "cr": "4",
  "prof_bonus": 2,
  "traits": [
    {
      "name": "Undead Fortitude",
      "entries": [
        "If damage reduces the zombie to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the zombie drops to 1 hit point instead."
      ]
    },
    {
      "name": "Unusual Nature",
      "entries": [
        "The zombie doesn't require air, food, drink, or sleep."
      ]
    },
    {
      "name": "Viral Aura",
      "entries": [
        "Any creature that starts its turn within 10 feet of the plague spreader must make a {@dc 12} Constitution saving throw. On a failed save, the creature is {@condition poisoned} and can't regain hit points until the end of its next turn. On a successful save, the creature is immune to this plague spreader's Viral Aura for 24 hours."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "entries": [
        "The plague spreader makes two Slam attacks."
      ]
    },
    {
      "name": "Slam",
      "entries": [
        "Melee atk +5 to hit, reach 5 ft., one target. 6 (1d6 + 3 damage) bludgeoning damage plus 9 (2d8 damage) necrotic damage."
      ]
    },
    {
      "name": "Virulent Miasma (1/Day)",
      "entries": [
        "The plague spreader releases toxic gas in a 30-foot-radius sphere centered on itself. Each creature in that area must make a DC 12 Constitution saving throw, taking 14 (4d6 damage) poison damage on a failed save, or half as much damage on a successful one. A Humanoid reduced to 0 hit points by this damage dies and rises as a zombie (see its stat block in the Monster Manual) 1 minute later. The zombie acts immediately after the plague spreader in the initiative count."
      ]
    }
  ],
  "legendary": [],
  "spellcasting": [],
  "conditionImmune": [
    "charmed",
    "exhaustion",
    "poisoned"
  ],
  "resist": [
    "necrotic"
  ],
  "vulnerable": [],
  "immune": [
    "poison"
  ],
  "senses": [
    "darkvision 60 ft."
  ],
  "environment": [],
  "hasToken": true,
  "hasFluff": true,
  "hasFluffImages": false
}